import { Link } from 'react-router-dom';
import { Facebook, Twitter, Instagram, Youtube, Mail, Phone } from 'lucide-react';
import { useTranslation } from '@/hooks/useTranslation';

const Footer = () => {
  const { t } = useTranslation();
  return (
    <div id="footer-wrapper">
      <div id="back-to-top" className="pressable" style={{display: "flex"}}>Επιστροφή στην κορυφή<svg aria-hidden="true" class="icon" width="12" height="12"><path d="M1.41 9.41L6 4.83L10.59 9.41L12 8L6 2L0 8L1.41 9.41Z"/></svg></div>
      <div id="promo-footer"></div>
      <div className="root__wrapper bp-footer">
        <div className="footer root">
          
          <div className="footer__top">
          <div className="footer__aside">
            <Link rel="home" title="BestPrice" class="footer__logo pressable" to="/">
              <svg aria-hidden="true" class="icon" width="100%" height="100%"><path fill-rule="evenodd" d="M25.016 8.96052C25.3883 8.98468 25.9053 8.91067 25.9914 9.40857C26.0751 9.8923 25.5021 10.1517 25.1015 10.2202C24.1869 10.377 23.2839 10.0922 22.4875 9.65742L22.2603 9.53529L21.5837 12.7709C22.9048 13.1744 24.5267 13.2773 25.8989 13.0421C28.2431 12.6404 30.3538 10.9752 29.9109 8.4146C29.5958 6.59385 28.2426 5.91754 26.5204 5.8318L25.5998 5.7846C25.2872 5.76493 24.7914 5.79123 24.7224 5.39303C24.6462 4.95211 25.1243 4.73833 25.4674 4.67941C26.3249 4.53251 27.1299 4.76076 27.8804 5.10075L28.4475 2.25371L28.9046 4.89594L31.0457 4.42658L32.3156 11.7668L36.2322 11.0956L34.9621 3.75537L37.1378 3.48522L36.5348 0L28.3015 1.41083L28.4316 2.16237C27.2896 1.72523 26.1166 1.60942 24.8846 1.82065C22.5403 2.22231 20.4565 4.04419 20.897 6.59038C21.1853 8.25475 22.6149 8.94727 24.2052 8.95297L25.016 8.96052ZM21.0173 10.6856L17.6011 11.271L17.419 10.2184L20.435 9.70156L19.9526 6.91345L16.9366 7.43021L16.7593 6.40596L20.0612 5.84027L19.5542 2.90984L12.3072 4.15174L14.1579 14.8482L10.4896 15.4768C12.1488 15.0332 13.6351 13.9518 13.2939 11.9798C13.0699 10.6852 12.1957 9.9709 10.9379 9.76171L10.9231 9.67638C11.829 9.21345 12.129 8.22467 11.9641 7.27169C11.5359 4.79655 9.33413 4.66126 7.23299 5.02113L2.67325 5.80255L4.52388 16.4989L0 17.2742L1.85586 28L5.62947 27.3532L5.07069 24.1242L7.07183 23.7813C9.25883 23.4065 10.3948 21.8058 10.0158 19.6152C9.59539 17.1848 7.82292 16.1729 5.6015 16.3446L9.55338 15.6672L11.4041 26.3638L15.2349 25.7074L14.6393 22.2649L17.0216 25.4011L25.3117 23.9806L23.4561 13.2549L21.5193 13.5867L21.0173 10.6856ZM6.24871 20.1288C6.3988 20.9965 5.67517 21.2378 4.98913 21.3553L4.60308 21.4213L4.28066 19.5579L4.65236 19.4943C5.29557 19.3841 6.10343 19.2896 6.24871 20.1288ZM7.01763 9.30581L6.75186 7.76949L7.46648 7.64705C7.9096 7.5711 8.35118 7.65653 8.4521 8.23976C8.58017 8.97938 7.94669 9.14657 7.37499 9.24454L7.01763 9.30581ZM8.15969 13.2698L7.71658 13.3457L7.40891 11.5676L7.79485 11.5014C8.42382 11.3937 9.42193 11.2079 9.57705 12.1042C9.7296 12.986 8.78856 13.1619 8.15969 13.2698ZM14.4727 19.6861L14.2012 19.7327L13.8862 17.9121L14.1864 17.8606C14.8725 17.743 15.4591 17.7304 15.6043 18.5697C15.742 19.3663 15.1161 19.5761 14.4727 19.6861ZM18.5913 21.5436C18.3203 21.2532 18.0645 21.1359 17.823 21.0162L17.8083 20.9308C19.1658 20.1856 19.6958 19.421 19.4128 17.7851C18.9902 15.3427 17.1354 14.5573 14.9783 14.7378L19.5447 13.9552L21.3585 24.4386L18.5913 21.5436ZM28.9009 17.8439C28.6989 16.6772 29.4966 15.5885 30.6688 15.3877C31.5692 15.2333 32.4273 15.5989 33.1571 16.0744L32.3363 12.0113C31.4439 11.8715 30.5306 11.8668 29.6301 12.0211C26.4711 12.5625 24.4312 15.4897 24.9728 18.6193C25.502 21.6776 28.3144 23.6419 31.3876 23.1154C32.0881 22.9952 33.5406 22.6292 34.1009 22.2109L33.5213 18.1797C32.9985 18.8991 32.3643 19.4033 31.4495 19.56C30.2775 19.761 29.1049 19.0244 28.9009 17.8439ZM33.527 14.936L33.3689 16.574L34.5123 16.3781L34.5962 16.8616L33.8813 16.9843L33.7234 18.6223L35.167 18.3751C36.3082 20.3766 38.5222 21.5203 40.9665 21.1014C41.667 20.9814 43.1196 20.6155 43.68 20.1971L43.3099 17.463C42.1131 17.9462 40.6457 18.2271 39.598 17.6156L42.4281 17.1308L42.5863 15.4925L38.5553 16.1832C38.5311 16.1288 38.5213 16.0718 38.5116 16.015L38.4796 15.83L38.4573 15.702L42.0738 15.0823L42.2319 13.4441L38.8585 14.022C39.6472 13.052 41.2292 12.7518 42.5282 12.6902L41.9153 9.99771C41.0226 9.85784 40.1094 9.85316 39.2088 10.0075C36.6933 10.4385 34.8702 12.4061 34.5275 14.7643L33.527 14.936ZM33.2002 24.6066C32.7805 24.6066 32.3434 24.8759 32.3434 25.3336C32.3434 25.7857 32.7806 26.0431 33.2002 26.0431C33.6199 26.0431 34.0568 25.7857 34.0568 25.3336C34.0569 24.8758 33.6199 24.6066 33.2002 24.6066ZM36.443 24.4522H37.1559C37.0813 24.7097 36.765 24.83 36.5178 24.83C36.0061 24.83 35.707 24.3836 35.707 23.9086C35.707 23.388 36.0175 22.9074 36.581 22.9074C36.8342 22.9074 37.0584 23.0161 37.179 23.2392L38.6509 22.7014C38.3118 21.9632 37.2768 21.5911 36.5234 21.5911C35.1607 21.5911 34.1201 22.4438 34.1201 23.8458C34.1201 25.2304 35.1896 26.0431 36.5121 26.0431C37.179 26.0431 37.892 25.7798 38.3521 25.2763C38.8637 24.7213 38.8581 24.1433 38.8753 23.4339H36.4431L36.443 24.4522ZM41.8249 24.315V24.2805C42.4055 24.0803 42.6643 23.8171 42.6643 23.1591C42.6643 22.0719 41.8422 21.6598 40.8589 21.6598H38.9556V25.9744H40.4964V24.5896H40.5253L41.2152 25.9744H43.0322L42.0891 24.5725C42.003 24.4409 41.9111 24.378 41.8249 24.315ZM40.6058 23.5711H40.4965V22.8386H40.6174C40.8933 22.8386 41.1233 22.8729 41.1233 23.2105C41.1232 23.531 40.8646 23.5711 40.6058 23.5711Z"/></svg>
              <span>BestPrice</span>
            </Link>
            <div class="footer__identity">
              <p>Η πραγματικά καλύτερη τιμή</p>
              <p>Το BestPrice είναι η πρώτη και μεγαλύτερη υπηρεσία σύγκρισης τιμών στην Ελλάδα.</p>
              <p>Στο BestPrice θα βρεις γρήγορα και εύκολα πραγματικές προσφορές και την καλύτερη τιμή από τα μεγαλύτερα καταστήματα.</p>
            </div>
          </div>
          
          <div className="footer__sections">
            <div className="footer__section">
              <div class="footer__section-header">
                <div class="footer__section-label">{t('categories')}</div>
                <div class="footer__section-icon">
                  <svg aria-hidden="true" class="icon" width="16" height="16"><path xmlns="http://www.w3.org/2000/svg" d="M1 13L9 5L17 13" stroke-linecap="round" stroke-linejoin="round"/></svg>
                </div>
              </div>
              <div class="footer__section-scroller">
                <div class="footer__section-content">
                  <ul>
                    <li><Link to="/categories/c1">{t('technology')}</Link></li>
                    <li><Link to="/categories/c2">Σπίτι & Κήπος</Link></li>
                    <li><Link to="/categories/c3">Μόδα</Link></li>
                    <li><Link to="/categories/c4">Υγεία & Ομορφιά</Link></li>
                    <li><Link to="/categories/c5">Παιδικά, Βρεφικά</Link></li>
                    <li><Link to="/categories/c1">Αθλητισμός, Hobby</Link></li>
                    <li><Link to="/categories/c2">Μηχανοκίνηση</Link></li>
                    <li><Link to="/deals">{t('deals')}</Link></li>
                    <li><Link to="/gifts">{t('gifts')}</Link></li>
                    <li><Link to="/give">BestPrice Give</Link></li>
                  </ul>
                </div>
              </div>
            </div>

            <div className="footer__section">
              <div class="footer__section-header">
                BestPrice
                <div class="footer__section-icon">
                  <svg aria-hidden="true" class="icon" width="16" height="16"><path xmlns="http://www.w3.org/2000/svg" d="M1 13L9 5L17 13" stroke-linecap="round" stroke-linejoin="round"/></svg>
                </div>
              </div>
              <div class="footer__section-scroller">
                <div class="footer__section-content">
                  <ul>
                    <li><Link to="/about">Σχετικά με εμάς</Link></li>
                    <li><Link to="/blog">Το Blog μας</Link></li>
                    <li><Link to="/guides">Οδηγοί αγοράς</Link></li>
                    <li><Link to="/insurance">Ασφάλιση Αγορών</Link></li>
                    <li><Link to="/advertising">Διαφήμιση</Link></li>
                    <li><Link to="/credits-club">Credits Club</Link></li>
                    <li><Link to="/certification">Πιστοποίηση BestPrice</Link></li>
                    <li><Link to="/customer-review-awards">Customer Review Awards</Link></li>
                    <li><Link to="/awards">Οι διακρίσεις μας</Link></li>
                    <li><Link to="/team">Η ομάδα μας</Link></li>
                    <li><Link to="/assistant">BestPrice Assistant</Link></li>
                    <li><Link to="/careers">Θέσεις εργασίας (5)</Link></li>
                    <li><Link to="/contact">Επικοινωνία</Link></li>
                  </ul>
                </div>
              </div>
            </div>

            <div className="footer__section footer__section--in-numbers">
              <div class="footer__section-header">
                Σε αριθμούς
                <div class="footer__section-icon">
                  <svg aria-hidden="true" class="icon" width="16" height="16"><path xmlns="http://www.w3.org/2000/svg" d="M1 13L9 5L17 13" stroke-linecap="round" stroke-linejoin="round"/></svg>
                </div>
              </div>
              <div class="footer__section-scroller">
                <div class="footer__section-content">
                  <ul>
                    <li><Link to="/stores">3.752 καταστήματα</Link></li>
                    <li><Link to="/categories">27.155.066 προϊόντα</Link></li>
                    <li><Link to="/brands">37.297 κατασκευαστές</Link></li>
                    <li><Link to="/deals">6.624 προσφορές</Link></li>
                  </ul>
                </div>
              </div>
            </div>

            <div className="footer__section footer__section--privacy">
              <div className="footer__section-header">
                Όροι χρήσης &amp; ιδιωτικότητα
                <div className="footer__section-icon">
                  <svg aria-hidden="true" class="icon" width="16" height="16"><path xmlns="http://www.w3.org/2000/svg" d="M1 13L9 5L17 13" stroke-linecap="round" stroke-linejoin="round"/></svg>
                </div>
              </div>
              
              <div className="footer__section-scroller">
                <div className="footer__section-content">
                  <ul>
                    <li><Link rel="nofollow" to="/policies/terms">Όροι χρήσης</Link></li>
                    <li><Link rel="nofollow" to="/policies/privacy">Πολιτική προσωπικών δεδομένων</Link></li>
                    <li><Link rel="nofollow" to="/policies/cookies">Χρήση cookies</Link></li>
                    <li><Link rel="nofollow" to="/gdpr">GDPR</Link></li>
                    <li><Link rel="nofollow" to="/policies/dsa">DSA</Link></li>
                  </ul>
                </div>
              </div>
            </div>

            <div className="footer__section footer__section--b2b">
              <div class="footer__b2b">
                <div class="footer__section-header">
                  BestPrice For Merchants
                  <div class="footer__section-icon">
                    <svg aria-hidden="true" class="icon" width="16" height="16"><path xmlns="http://www.w3.org/2000/svg" d="M1 13L9 5L17 13" stroke-linecap="round" stroke-linejoin="round"/></svg>
                  </div>
                </div>
                <div class="footer__section-scroller">
                  <div class="footer__section-content">
                    <p>Έχεις ηλεκτρονικό κατάστημα;</p>
                    <p>Δες πως το BestPrice μπορεί να σε βοηθήσει να αυξήσεις τις πωλήσεις σου!</p>
                    <Link title="Πληροφορίες και είσοδος στο BestPrice For Merchants" to="https://merchants.nexushub-commerce.lovable.app" class="button">Για εμπόρους</Link>
                  </div>
                </div>
              </div>
              
              <div class="footer__b2b">
                <div class="footer__section-header">
                  <div>BestPrice For Brands</div>
                  <div class="footer__section-icon">
                    <svg aria-hidden="true" class="icon" width="16" height="16"><path xmlns="http://www.w3.org/2000/svg" d="M1 13L9 5L17 13" stroke-linecap="round" stroke-linejoin="round"/></svg>
                  </div>
                </div>
                <div class="footer__section-scroller">
                  <div class="footer__section-content">
                    <p>Το BestPrice for Brands θα προσφέρει χρήσιμες πληροφορίες &amp; υπηρεσίες σε κατασκευαστές (Brands).</p>
                    <Link title="Εκδήλωση ενδιαφέροντος για το BestPrice For Brands" to="https://brands.nexushub-commerce.lovable.app" class="button">Περισσότερα</Link>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
          
          <div className="footer__social">
            <Link target="_blank" rel="external nofollow noopener" title="Το BestPrice στο Facebook" to="https://www.facebook.com" data-network="facebook" class="footer__network"><svg aria-hidden="true" class="icon" width="24" height="24"><path xmlns="http://www.w3.org/2000/svg" d="M24.045 12C24.045 5.34722 18.6528 -0.0449829 12 -0.0449829C5.34716 -0.0449829 -0.0450439 5.34722 -0.0450439 12C-0.0450439 18.0126 4.35716 22.9956 10.119 23.8998V15.4848H7.06316V12H10.119V9.34682C10.119 6.33062 11.9142 4.66082 14.6664 4.66082C15.9864 4.66082 17.3658 4.89842 17.3658 4.89842V7.86182H15.8478C14.3496 7.86182 13.8876 8.79242 13.8876 9.74282V12H17.2272L16.6926 15.4848H13.8876V23.8998C19.6428 22.9956 24.045 18.0126 24.045 12Z"/></svg></Link>
            <Link target="_blank" rel="external nofollow noopener" title="Το BestPrice στο Twitter" to="https://www.x.com" data-network="x" class="footer__network"><svg aria-hidden="true" class="icon" width="24" height="24"><path d="M16.754 16.7299H15.5645L7.79904 6.57762H9.07555L16.754 16.7299Z"/><path fill-rule="evenodd" d="M12 24C18.6274 24 24 18.6274 24 12C24 5.37258 18.6274 0 12 0C5.37258 0 0 5.37258 0 12C0 18.6274 5.37258 24 12 24ZM18.4647 5.36017H16.3179L12.7805 9.40383L9.72191 5.36017H5.29211L10.585 12.2813L5.56857 18.0149H7.71663L11.5883 13.5909L14.972 18.0149H19.2921L13.7747 10.7206L18.4647 5.36017Z"/></svg></Link>
            <Link target="_blank" rel="external nofollow noopener" title="Το BestPrice στο Threads" to="https://www.threads.net" data-network="Threads" class="footer__network"><svg aria-hidden="true" class="icon" width="24" height="24"><path d="M10.4385 13.5944C10.4825 14.4202 11.3754 14.8057 12.2342 14.7569C13.0759 14.7106 14.0299 14.38 14.1921 12.3489C13.7554 12.2537 13.276 12.2037 12.7624 12.2037C12.6075 12.2037 12.4489 12.2074 12.2867 12.2171C10.874 12.2989 10.4056 12.982 10.4385 13.5944Z"/><path fill-rule="evenodd" d="M24 12C24 18.6274 18.6274 24 12 24C5.37258 24 0 18.6274 0 12C0 5.37258 5.37258 0 12 0C18.6274 0 24 5.37258 24 12ZM15.573 11.3291C15.6438 11.3596 15.7121 11.3901 15.7804 11.423C16.7417 11.8841 17.4456 12.5831 17.814 13.4419C18.3275 14.6423 18.3751 16.5953 16.8149 18.1543C15.6218 19.3461 14.1738 19.8829 12.1208 19.8975H12.111C9.80055 19.8817 8.0244 19.1034 6.83135 17.5871C5.76883 16.2379 5.22111 14.3593 5.20281 12.0049V11.9927C5.22233 9.6383 5.77005 7.7609 6.83135 6.41049C8.0244 4.89295 9.80055 4.11589 12.111 4.10003H12.1208C14.4361 4.11589 16.2318 4.89051 17.4602 6.40195C18.0665 7.1473 18.5117 8.04635 18.7948 9.08935L17.4663 9.44434C17.2321 8.59652 16.8783 7.86947 16.4087 7.29125C15.4498 6.11284 14.0067 5.50899 12.1159 5.49436C10.2397 5.50777 8.81976 6.10918 7.89753 7.28271C7.03385 8.38182 6.58738 9.96767 6.5703 11.9988C6.58738 14.0299 7.03385 15.617 7.89753 16.7148C8.81976 17.8872 10.2397 18.4898 12.1159 18.5032C13.8079 18.491 14.9277 18.0884 15.8585 17.1577C16.921 16.0964 16.9015 14.7935 16.5611 14.0006C16.3611 13.5346 15.9988 13.1467 15.5108 12.8515C15.3913 13.7383 15.1217 14.4422 14.6959 14.9851C14.1348 15.6999 13.3309 16.0915 12.3062 16.1476C11.5291 16.1903 10.7826 16.0037 10.2031 15.6206C9.51754 15.168 9.1162 14.4739 9.0735 13.6688C8.98933 12.0817 10.2482 10.9387 12.2086 10.8253C12.9039 10.785 13.5554 10.8167 14.1568 10.9192C14.0775 10.43 13.9164 10.0433 13.6749 9.76273C13.3431 9.37725 12.8307 9.18085 12.1525 9.17597H12.1342C11.5889 9.17597 10.8484 9.32845 10.3776 10.0433L9.24428 9.26624C9.87618 8.30863 10.9009 7.78286 12.1342 7.78286H12.1622C14.2239 7.79628 15.4511 9.08204 15.573 11.3291Z"/></svg></Link>
            <Link target="_blank" rel="external nofollow noopener" title="Το BestPrice στο Facebook" to="https://www.instagram.com" data-network="instagram" class="footer__network"><svg aria-hidden="true" class="icon" width="24" height="24"><path xmlns="http://www.w3.org/2000/svg" fill-rule="evenodd" d="M3.36743 23.4115C3.88314 23.6127 4.65848 23.8502 6.08577 23.9151C7.62862 23.9864 8.09225 24 11.9996 24C15.9085 24 16.3721 23.9857 17.9149 23.9151C19.3422 23.8502 20.1176 23.6127 20.6333 23.4115C21.3166 23.1455 21.8045 22.8288 22.3166 22.3166C22.8288 21.8045 23.1455 21.3173 23.4115 20.634C23.6113 20.1183 23.8502 19.3429 23.9151 17.9157C23.9857 16.3714 24 15.9077 24 12.0004C24 8.09154 23.9857 7.62933 23.9151 6.08506C23.8502 4.65777 23.6127 3.88243 23.4115 3.36672C23.1455 2.68339 22.8295 2.1955 22.3166 1.68336C21.8038 1.17122 21.3166 0.853092 20.6333 0.588463C20.1161 0.388742 19.3422 0.14979 17.9149 0.0848813C16.3707 0.0156923 15.9085 0 11.9996 0C8.09225 0 7.62861 0.0142658 6.08506 0.0848813C4.65777 0.14979 3.88243 0.387315 3.36672 0.588463C2.68268 0.853092 2.1955 1.17122 1.68336 1.68336C1.17193 2.19693 0.854519 2.6841 0.588463 3.36743C0.388742 3.88457 0.14979 4.65848 0.0848813 6.08577C0.0156923 7.63004 0 8.09225 0 12.0011C0 15.9099 0.0142658 16.3728 0.0855946 17.9157C0.150504 19.3429 0.388029 20.1183 0.589176 20.634C0.853806 21.3173 1.17122 21.8045 1.68407 22.3166C2.19693 22.8288 2.6841 23.1455 3.36743 23.4115ZM12.0249 9.07884C10.3835 9.07884 9.05331 10.4098 9.05331 12.0511C9.05331 13.6925 10.3835 15.0234 12.0249 15.0234C13.6662 15.0234 14.9971 13.6925 14.9971 12.0511C14.9971 10.4098 13.6662 9.07884 12.0249 9.07884ZM12.0249 16.6294C9.49626 16.6294 7.44655 14.5797 7.44655 12.0511H7.44663C7.44663 9.52236 9.49626 7.4728 12.0249 7.4728C14.5535 7.4728 16.6032 9.5225 16.6032 12.0511C16.6032 14.5797 14.5535 16.6294 12.0249 16.6294ZM15.8946 7.88576C15.7771 7.70977 15.7145 7.50288 15.7146 7.29127C15.7148 7.00762 15.8276 6.73566 16.0282 6.53513C16.2288 6.3346 16.5008 6.2219 16.7845 6.22176H16.7849C16.9965 6.22185 17.2034 6.28468 17.3793 6.40232C17.5552 6.51995 17.6922 6.68711 17.7731 6.88265C17.854 7.07818 17.8751 7.29332 17.8338 7.50085C17.7924 7.70838 17.6904 7.89898 17.5407 8.04855C17.3911 8.19813 17.2004 8.29995 16.9928 8.34115C16.7852 8.38235 16.5701 8.36108 16.3747 8.28002C16.1792 8.19896 16.0121 8.06176 15.8946 7.88576ZM6.767 19.002C7.08099 19.1243 7.55348 19.2691 8.42276 19.3087V19.3088C9.3623 19.352 9.64384 19.3607 12.0249 19.3607C14.4059 19.3607 14.6882 19.352 15.628 19.3088C16.4973 19.2693 16.9699 19.1245 17.2838 19.0021C17.7001 18.84 17.9975 18.6467 18.3094 18.3352C18.6212 18.0236 18.8142 17.7266 18.9763 17.3103C19.0979 16.9963 19.2434 16.5239 19.283 15.6546C19.3262 14.714 19.3349 14.4324 19.3349 12.0514C19.3349 9.67037 19.3262 9.38883 19.283 8.44822C19.2435 7.57894 19.0987 7.10631 18.9763 6.79247C18.8142 6.37619 18.6216 6.07875 18.3094 5.7669C17.9971 5.45505 17.7001 5.26132 17.2838 5.09998C16.969 4.97872 16.4973 4.83285 15.628 4.79326C14.6874 4.75046 14.4048 4.74126 12.0249 4.74126C9.64491 4.74126 9.36259 4.74989 8.42276 4.79312C7.55348 4.83263 7.08085 4.97743 6.767 5.09983C6.35002 5.26118 6.05329 5.45448 5.74144 5.76676C5.42959 6.07903 5.23657 6.37605 5.07451 6.79232C4.95326 7.1071 4.80739 7.57879 4.7678 8.44808C4.72529 9.38869 4.71594 9.67023 4.71594 12.0513C4.71594 14.4323 4.72458 14.7146 4.7678 15.6544C4.80732 16.5237 4.95211 16.9963 5.07451 17.3102C5.23586 17.7265 5.42916 18.0232 5.74144 18.335C6.05372 18.6469 6.35073 18.8399 6.767 19.002ZM6.18475 3.60314C6.75117 3.38273 7.39976 3.23223 8.34893 3.18901H8.34929C9.30046 3.14507 9.60496 3.13501 12.0259 3.13501C14.4469 3.13501 14.7507 3.14557 15.7015 3.18901C16.65 3.23152 17.2982 3.38273 17.8657 3.60314C18.4512 3.83075 18.949 4.13532 19.4444 4.63156C19.9399 5.12779 20.2446 5.62474 20.4728 6.21099C20.6932 6.77741 20.8437 7.42594 20.887 8.37518C20.9302 9.32585 20.9402 9.62978 20.9402 12.0511C20.9402 14.4724 20.9302 14.7757 20.887 15.727C20.8445 16.6762 20.6932 17.3244 20.4728 17.8912C20.2446 18.4775 19.9406 18.9752 19.4444 19.4707C18.9482 19.9661 18.4512 20.2708 17.865 20.4991C17.2982 20.7195 16.65 20.87 15.7008 20.9132C14.7501 20.9572 14.4462 20.9672 12.0249 20.9672C9.60354 20.9672 9.3001 20.9564 8.34893 20.9132C7.39976 20.87 6.75224 20.7195 6.18475 20.4991C5.59778 20.2708 5.10148 19.9659 4.60531 19.4707C4.10915 18.9754 3.80451 18.4775 3.5769 17.8912C3.35649 17.3244 3.20599 16.6763 3.16276 15.727C3.11882 14.7764 3.10876 14.4724 3.10876 12.0511C3.10876 9.62978 3.11882 9.32585 3.16276 8.37518C3.20599 7.42601 3.35649 6.77777 3.5769 6.21099C3.80451 5.62403 4.10908 5.12701 4.60531 4.63156C5.10155 4.13611 5.5985 3.83075 6.18475 3.60314Z"/></svg></Link>
            <Link target="_blank" rel="external nofollow noopener" title="Το BestPrice στο TikTok" to="https://www.tiktok.com" data-network="tiktok" class="footer__network"><svg aria-hidden="true" class="icon" width="24" height="24"><path xmlns="http://www.w3.org/2000/svg" fill-rule="evenodd" d="M12.0036 0C18.6283 0 24.0072 5.37174 24.0072 12.0036C24.0072 18.6283 18.6355 24.0072 12.0036 24.0072C5.37894 24.0072 0 18.6355 0 12.0036C0 5.37894 5.37174 0 12.0036 0ZM14.6031 5.35734C14.8263 7.24392 15.8776 8.36724 17.6994 8.48245V10.5995C16.6409 10.7003 15.712 10.3546 14.6319 9.70657V13.667C14.6319 18.7075 9.13771 20.2772 6.93429 16.6697C5.51575 14.351 6.38704 10.2682 10.9379 10.1098V12.3492C10.5923 12.4068 10.225 12.4932 9.88659 12.6085C8.87129 12.9469 8.30243 13.595 8.46085 14.7255C8.77048 16.8929 12.7453 17.5338 12.414 13.2997V5.36454H14.6103L14.6031 5.35734Z"/></svg></Link>
            <Link target="_blank" rel="external nofollow noopener" title="Το BestPrice στο YouTube" to="https://www.youtube.com" data-network="youtube" class="footer__network"><svg aria-hidden="true" class="icon" width="100%" height="100%"><path xmlns="http://www.w3.org/2000/svg" d="M23.25 7.44C23.25 6.52766 22.8876 5.65268 22.2424 5.00755C21.5973 4.36243 20.7223 4 19.81 4H4.19C3.73825 4 3.29093 4.08898 2.87357 4.26185C2.45621 4.43473 2.07699 4.68812 1.75755 5.00755C1.11243 5.65268 0.75 6.52766 0.75 7.44V16.56C0.75 17.4723 1.11243 18.3473 1.75755 18.9924C2.07699 19.3119 2.45621 19.5653 2.87357 19.7381C3.29093 19.911 3.73825 20 4.19 20H19.81C20.7223 20 21.5973 19.6376 22.2424 18.9924C22.8876 18.3473 23.25 17.4723 23.25 16.56V7.44ZM9.5 15.94V7.28L16.27 11.61L9.5 15.94Z" stroke-linecap="round" stroke-linejoin="round"/></svg></Link>
            <Link target="_blank" rel="external nofollow noopener" title="Το BestPrice στο LinkedIn" to="https://www.linkedin.com/company/" data-network="linkedin" class="footer__network"><svg aria-hidden="true" class="icon" width="24" height="24"><path xmlns="http://www.w3.org/2000/svg" d="M11.9865 0.131897C5.43931 0.131897 0.131836 5.43937 0.131836 11.9866C0.131836 18.5338 5.43931 23.8413 11.9865 23.8413C18.5337 23.8413 23.8412 18.5338 23.8412 11.9866C23.8412 5.43937 18.5337 0.131897 11.9865 0.131897ZM8.34766 18.5609H5.61713V9.77819H8.34766V18.5609ZM6.98253 8.57823C6.10791 8.57823 5.40059 7.86906 5.40059 6.99576C5.40059 6.12168 6.10791 5.41224 6.98253 5.41224C7.8553 5.41224 8.56447 6.12141 8.56447 6.99576C8.56447 7.86906 7.85503 8.57823 6.98253 8.57823ZM18.5725 18.5609H15.844V14.2898C15.844 13.2711 15.8264 11.961 14.4254 11.961C13.005 11.961 12.7882 13.0714 12.7882 14.2166V18.5609H10.0597V9.77819H12.678V10.9792H12.7152C13.0795 10.2885 13.9702 9.56059 15.2979 9.56059C18.0622 9.56059 18.5725 11.3791 18.5725 13.744V18.5609Z"/></svg></Link>
          </div>
          
          <div className="footer__bottom">
            <div className="footer__copy">
              <Link className="footer__besto" rel="home" title="Αρχική σελίδα" to="/">
                <svg className="footer__besto" width="20" height="24" viewBox="0 0 20 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path opacity="0.7" fill-rule="evenodd" clip-rule="evenodd" d="M9.31465 7.39144L9.31034 1.94406C9.30909 0.35542 10.7761 -0.491803 12.1517 0.302442L19.391 4.48202L19.4081 4.49209C19.9694 4.82843 20.1591 5.55421 19.8307 6.12305L19.8206 6.14017C19.4843 6.70151 18.7585 6.89117 18.1897 6.56276L11.7137 2.82386L11.7173 7.38954C11.7178 8.05301 11.1804 8.59128 10.5169 8.5918C9.85345 8.59233 9.31518 8.05491 9.31465 7.39144ZM13.5325 14.6278C12.9579 14.2961 12.7611 13.5614 13.0928 12.9868C13.4245 12.4122 14.1592 12.2153 14.7338 12.5471L19.3991 15.2406C19.9737 15.5723 20.1706 16.307 19.8389 16.8816C19.5071 17.4562 18.7724 17.6531 18.1978 17.3213L13.5325 14.6278Z" fill="#7C8796"></path>
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M7.50285 3.8762C8.06419 3.53986 8.25386 2.81408 7.92544 2.24524C7.59371 1.67066 6.85899 1.47379 6.28441 1.80553L1.6486 4.48202L1.62029 4.4986C0.688823 5.0522 0.007475 6.24182 0.00661889 7.32305L0 15.6797L0.00010011 15.6958L0 15.7066C0 16.7987 0.694851 18.0029 1.64053 18.5513L8.89021 22.7555L8.93148 22.7789C10.2945 23.5359 11.736 22.694 11.736 21.1191V12.76L11.7358 12.7272C11.7221 11.6438 11.0317 10.4582 10.0955 9.91524L3.58377 6.139L7.48573 3.88627L7.50285 3.8762ZM2.40259 15.6816L2.40849 8.23485L8.89016 11.9937L8.90138 12.0004C9.10388 12.1276 9.33337 12.5295 9.33337 12.76L9.33333 20.235L2.8458 16.4728L2.83458 16.4661C2.63208 16.3389 2.40259 15.937 2.40259 15.7066L2.40244 15.693L2.40259 15.6816Z" fill="#758190"></path>
                </svg>
                The Best Company S.A.&nbsp;<span className="hide-mobile">&nbsp;©&nbsp; {new Date().getFullYear()}</span>
              </Link>
            </div>
          
            <div className="footer__privacy">
              <Link rel="nofollow" title="Όροι χρήσης" to="/policies/terms">Όροι χρήσης</Link>
              <Link rel="nofollow" title="Προσωπικά δεδομένα" to="/policies/privacy">Προσωπικά δεδομένα</Link>
              <Link rel="nofollow" title="Cookies" to="/policies/cookies">Cookies</Link>
              <Link rel="nofollow" title="GDPR" to="/gdpr">GDPR</Link>
              <Link rel="nofollow" title="GDPR" to="/policies/dsa">DSA</Link>
            </div>
          </div>
          
        </div>
      </div>
    </div>
  );
};

export default Footer;
